## DataFrame
```Used in 2-D
Can hold heterogeneous Data```

In [13]:
import pandas as pd
s=pd.Series(['a','b','c','d'])
df=pd.DataFrame(s)
df #to print df -> write only df instead print(df)

   0
0  a
1  b
2  c
3  d

In [14]:
dict={'Name':['Ram','Shyam'],'team':['Pata','Nhi']}
df1=pd.DataFrame(dict)
df1

    Name  team
0    Ram  Pata
1  Shyam   Nhi

In [15]:
name=pd.Series(['Hardik','Virat'])
team=pd.Series(['MI','RCB'])
dict2={'Name':name,'Team':team}
df=pd.DataFrame(dict2)
df

     Name Team
0  Hardik   MI
1   Virat  RCB

In [16]:
#list of dictionaries
dict1=[
    {'FirstName': 'Sachin','LastName':'Sahoo'},
    {'FirstName':'Rahul','LastName':'Mishra'},
    {'FirstName':'Kartik','LastName':'Kumar'}
]
df1=pd.DataFrame(dict1)
df1

  FirstName LastName
0    Sachin    Sahoo
1     Rahul   Mishra
2    Kartik    Kumar

In [17]:
#Iteration on Rows And Column
for(row_index, row_value) in df1.iterrows():
    print("\nRow index is ::",row_index)
    print("\nRow index is ::",row_value)

Row index is :: 0

Row index is :: FirstName    Sachin
LastName      Sahoo
Name: 0, dtype: object

Row index is :: 1

Row index is :: FirstName     Rahul
LastName     Mishra
Name: 1, dtype: object

Row index is :: 2

Row index is :: FirstName    Kartik
LastName      Kumar
Name: 2, dtype: object

In [18]:
for column_name, column_values in df1.items():
    print("\nColumn name is:", column_name)
    print("Column values are:")
    print(column_values)

Column name is: FirstName
Column values are:
0    Sachin
1     Rahul
2    Kartik
Name: FirstName, dtype: object

Column name is: LastName
Column values are:
0     Sahoo
1    Mishra
2     Kumar
Name: LastName, dtype: object

In [19]:
empdata = {
    'emp_id': [101, 102, 103, 104, 105, 106],
    'e_name': ['Sachin', 'Vinod', 'Lakhbir', 'Anil', 'Devinder', 'UmaSelvi'],
    'Doj': ['12-01-2012', '15-01-2012', '05-09-2007', '17-01-2012', '05-09-2007', '16-01-2012']
}
df=pd.DataFrame(empdata)
df

   emp_id    e_name         Doj
0     101    Sachin  12-01-2012
1     102     Vinod  15-01-2012
2     103   Lakhbir  05-09-2007
3     104      Anil  17-01-2012
4     105  Devinder  05-09-2007
5     106  UmaSelvi  16-01-2012

In [20]:
df.emp_id

0    101
1    102
2    103
3    104
4    105
5    106
Name: emp_id, dtype: int64

In [21]:
df[['emp_id','e_name']]

   emp_id    e_name
0     101    Sachin
1     102     Vinod
2     103   Lakhbir
3     104      Anil
4     105  Devinder
5     106  UmaSelvi

In [22]:
df.emp_id[3] #To Get the particular column

104

In [23]:
#Series -> DataFrame
s = pd.Series([10,15,18,22])
df=pd.DataFrame(s) 
df

    0
0  10
1  15
2  18
3  22

In [24]:
df.columns=['list1'] #Naming the firstColumn as list1
df

   list1
0     10
1     15
2     18
3     22

In [25]:
df['list2']=[20,21,22,23] #Adding a new column to dataset
df

   list1  list2
0     10     20
1     15     21
2     18     22
3     22     23

In [26]:
df['list3']=df['list1']+df['list2'] #we can +,-,*,/,//,%
df

   list1  list2  list3
0     10     20     30
1     15     21     36
2     18     22     40
3     22     23     45

In [27]:
#Deleting Columns
del df['list1'] #deleting list1
df

   list2  list3
0     20     30
1     21     36
2     22     40
3     23     45

In [28]:
df.pop('list3')
df

   list2
0     20
1     21
2     22
3     23

In [29]:
df1=df.drop(index=[2,3],axis=1)
df1

   list2
0     20
1     21

In [30]:
Runs = {
    'TCS': {'Qtr1': 2500, 'Qtr2': 2000, 'Qtr3': 3000, 'Qtr4': 2000},
    'WIPRO': {'Qtr1': 2800, 'Qtr2': 2400, 'Qtr3': 3600, 'Qtr4': 2400},
    'L&T': {'Qtr1': 2100, 'Qtr2': 5700, 'Qtr3': 35000, 'Qtr4': 2100}
}
#print(type(Runs))
df = pd.DataFrame(Runs)
df

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000
Qtr4  2000   2400   2100

In [31]:
df1=df.loc['Qtr3', :]
df1

TCS       3000
WIPRO     3600
L&T      35000
Name: Qtr3, dtype: int64

In [32]:
df3=df.loc['Qtr1':'Qtr3', :]
df3

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000

In [33]:
print(df.loc[:,'TCS']) #To print one specific column

Qtr1    2500
Qtr2    2000
Qtr3    3000
Qtr4    2000
Name: TCS, dtype: int64

In [34]:
empdata = {
    'empid': [101, 102, 103, 104, 105, 106],
    'ename': ['Sachin', 'Vinod', 'Lakhbir', 'Anil', 'Devinder', 'UmaSelvi'],
    'Doj': ['12-01-2012', '15-01-2012', '05-09-2007', '17-01-2012', '05-09-2007', '16-01-2012']
}
#print(type(empdata))
df = pd.DataFrame(empdata)
df

   empid     ename         Doj
0    101    Sachin  12-01-2012
1    102     Vinod  15-01-2012
2    103   Lakhbir  05-09-2007
3    104      Anil  17-01-2012
4    105  Devinder  05-09-2007
5    106  UmaSelvi  16-01-2012

In [35]:
print(df.iloc[0:2])

   empid   ename         Doj
0    101  Sachin  12-01-2012
1    102   Vinod  15-01-2012

In [36]:
# Data dictionary for company earnings
Runs = {
    'TCS': {'Qtr1': '2500', 'Qtr2': '2000', 'Qtr3': '3000', 'Qtr4': '2000'},
    'WIPRO': {'Qtr1': '2800', 'Qtr2': '2400', 'Qtr3': '3600', 'Qtr4': '2400'},
    'L&T': {'Qtr1': '2100', 'Qtr2': '5700', 'Qtr3': '35000', 'Qtr4': '2100'}
}
df = pd.DataFrame(Runs)
print(df)
# Accessing specific rows and columns using iloc
print(df.iloc[0:2, 1:2])  # First 2 rows, second column
print(df.iloc[:, 0:2])    # All rows, first 2 columns

       TCS WIPRO    L&T
Qtr1  2500  2800   2100
Qtr2  2000  2400   5700
Qtr3  3000  3600  35000
Qtr4  2000  2400   2100
     WIPRO
Qtr1  2800
Qtr2  2400
       TCS WIPRO
Qtr1  2500  2800
Qtr2  2000  2400
Qtr3  3000  3600
Qtr4  2000  2400

In [37]:
df.tail(2)

       TCS WIPRO    L&T
Qtr3  3000  3600  35000
Qtr4  2000  2400   2100

In [38]:
# Data for students' marks in different tests
marks = pd.DataFrame({
    'Wally' : [87, 89, 93, 87, 92],
    'Eva' : [95, 99, 87, 88, 84],
    'Sam' : [88, 94, 85, 89, 95],
    'Katie' : [87, 92, 95, 84, 85],
    'Bob' : [83, 93, 86, 83, 87]
}, index = ['Test01', 'Test02', 'Test03', 'Test04', 'Test05'])
marks

        Wally  Eva  Sam  Katie  Bob
Test01     87   95   88     87   83
Test02     89   99   94     92   93
Test03     93   87   85     95   86
Test04     87   88   89     84   83
Test05     92   84   95     85   87

In [39]:
print(marks['Eva']['Test01'])

95

In [ ]:
print(marks['Test01']['Eva']) #Error

In [41]:
print(marks.Eva.Test01)

95

In [42]:
print(marks.at['Test01','Eva'])

95

In [45]:
print(marks.iat[0,1]) #iat(indexat)

95

In [46]:
#print students with marks >= 90
print('O grade Students: ')
marks[marks>=90]

O grade Students:

        Wally   Eva   Sam  Katie   Bob
Test01    NaN  95.0   NaN    NaN   NaN
Test02    NaN  99.0  94.0   92.0  93.0
Test03   93.0   NaN   NaN   95.0   NaN
Test04    NaN   NaN   NaN    NaN   NaN
Test05   92.0   NaN  95.0    NaN   NaN

In [47]:
marks[marks>=[90,91,92,93,94]]

        Wally   Eva   Sam  Katie  Bob
Test01    NaN  95.0   NaN    NaN  NaN
Test02    NaN  99.0  94.0    NaN  NaN
Test03   93.0   NaN   NaN   95.0  NaN
Test04    NaN   NaN   NaN    NaN  NaN
Test05   92.0   NaN  95.0    NaN  NaN

In [54]:
print("\nA grade Students: ")
marks[(marks>=80)&(marks<90)]

A grade Students:

        Wally   Eva   Sam  Katie   Bob
Test01   87.0   NaN  88.0   87.0  83.0
Test02   89.0   NaN   NaN    NaN   NaN
Test03    NaN  87.0  85.0    NaN  86.0
Test04   87.0  88.0  89.0   84.0  83.0
Test05    NaN  84.0   NaN   85.0  87.0